{
  "Arn": "arn:aws:cloudformation:us-east-1::type/resource/bb989456c78c398a858fef18f2ca1bfc1fbba082/MongoDB-Atlas-Cluster",
  "Type": "RESOURCE",
  "TypeName": "MongoDB::Atlas::Cluster",
  "Description": "The cluster resource provides access to your cluster configurations. The resource lets you create, edit and delete clusters. The resource requires your Project ID.",
  "Schema": "{\n    \"typeName\": \"MongoDB::Atlas::Cluster\",\n    \"description\": \"The cluster resource provides access to your cluster configurations. The resource lets you create, edit and delete clusters. The resource requires your Project ID.\",\n    \"definitions\": {\n        \"advancedAutoScaling\": {\n            \"type\": \"object\",\n            \"description\": \"AWS Automatic Cluster Scaling\",\n            \"properties\": {\n                \"DiskGB\": {\n                    \"$ref\": \"#/definitions/diskGB\"\n                },\n                \"Compute\": {\n                    \"$ref\": \"#/definitions/compute\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"compute\": {\n            \"type\": \"object\",\n            \"description\": \"Automatic Compute Scaling\",\n            \"properties\": {\n                \"Enabled\": {\n                    \"type\": \"boolean\",\n                    \"description\": \"Flag that indicates whether someone enabled instance size auto-scaling.\\n\\nSet to true to enable instance size auto-scaling. If enabled, you must specify a value for replicationSpecs[n].regionConfigs[m].autoScaling.compute.maxInstanceSize.\\nSet to false to disable instance size automatic scaling.\"\n                },\n                \"ScaleDownEnabled\": {\n                    \"type\": \"boolean\",\n                    \"description\": \"Flag that indicates whether the instance size may scale down. MongoDB Cloud requires this parameter if \\\"replicationSpecs[n].regionConfigs[m].autoScaling.compute.enabled\\\" : true. If you enable this option, specify a value for replicationSpecs[n].regionConfigs[m].autoScaling.compute.minInstanceSize.\"\n                },\n                \"MinInstanceSize\": {\n                    \"type\": \"string\",\n                    \"description\": \"Minimum instance size to which your cluster can automatically scale. MongoDB Cloud requires this parameter if \\\"replicationSpecs[n].regionConfigs[m].autoScaling.compute.enabled\\\" : true.\"\n                },\n                \"MaxInstanceSize\": {\n                    \"type\": \"string\",\n                    \"description\": \"Maximum instance size to which your cluster can automatically scale. MongoDB Cloud requires this parameter if \\\"replicationSpecs[n].regionConfigs[m].autoScaling.compute.enabled\\\" : true.\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"advancedRegionConfig\": {\n            \"type\": \"object\",\n            \"description\": \"Hardware specifications for nodes set for a given region. Each regionConfigs object describes the region's priority in elections and the number and type of MongoDB nodes that MongoDB Cloud deploys to the region. Each regionConfigs object must have either an analyticsSpecs object, electableSpecs object, or readOnlySpecs object. Tenant clusters only require electableSpecs. Dedicated clusters can specify any of these specifications, but must have at least one electableSpecs object within a replicationSpec. Every hardware specification must use the same instanceSize.\\n\\nExample:\\n\\nIf you set \\\"replicationSpecs[n].regionConfigs[m].analyticsSpecs.instanceSize\\\" : \\\"M30\\\", set \\\"replicationSpecs[n].regionConfigs[m].electableSpecs.instanceSize\\\" : \\\"M30\\\"if you have electable nodes and\\\"replicationSpecs[n].regionConfigs[m].readOnlySpecs.instanceSize\\\" : \\\"M30\\\" if you have read-only nodes.\\\",\",\n            \"properties\": {\n                \"AnalyticsAutoScaling\": {\n                    \"$ref\": \"#/definitions/advancedAutoScaling\"\n                },\n                \"AutoScaling\": {\n                    \"$ref\": \"#/definitions/advancedAutoScaling\"\n                },\n                \"RegionName\": {\n                    \"type\": \"string\"\n                },\n                \"AnalyticsSpecs\": {\n                        \"$ref\": \"#/definitions/specs\"\n                },\n                \"ElectableSpecs\": {\n                        \"$ref\": \"#/definitions/specs\"\n                },\n                \"Priority\": {\n                    \"type\": \"integer\"\n                },\n                \"ReadOnlySpecs\": {\n                        \"$ref\": \"#/definitions/specs\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"specs\": {\n            \"type\": \"object\",\n            \"properties\": {\n                \"DiskIOPS\" : {\n                    \"type\": \"string\",\n                    \"description\": \"Target throughput desired for storage attached to your AWS-provisioned cluster. Only change this parameter if you:\\n\\nset \\\"replicationSpecs[n].regionConfigs[m].providerName\\\" : \\\"AWS\\\".\\nset \\\"replicationSpecs[n].regionConfigs[m].electableSpecs.instanceSize\\\" : \\\"M30\\\" or greater not including Mxx_NVME tiers.\\nThe maximum input/output operations per second (IOPS) depend on the selected .instanceSize and .diskSizeGB. This parameter defaults to the cluster tier's standard IOPS value. Changing this value impacts cluster cost. MongoDB Cloud enforces minimum ratios of storage capacity to system memory for given cluster tiers. This keeps cluster performance consistent with large datasets.\\n\\nInstance sizes M10 to M40 have a ratio of disk capacity to system memory of 60:1.\\nInstance sizes greater than M40 have a ratio of 120:1.\"\n                },\n                \"EbsVolumeType\": {\n                    \"type\": \"string\",\n                    \"description\": \"Type of storage you want to attach to your AWS-provisioned cluster.\\n\\nSTANDARD volume types can't exceed the default input/output operations per second (IOPS) rate for the selected volume size.\\n\\nPROVISIONED volume types must fall within the allowable IOPS range for the selected volume size.\\\"\"\n                },\n                \"InstanceSize\": {\n                    \"type\": \"string\",\n                    \"description\": \"Hardware specification for the instance sizes in this region. Each instance size has a default storage and memory capacity. The instance size you select applies to all the data-bearing hosts in your instance size. If you deploy a Global Cluster, you must choose a instance size of M30 or greater.\"\n                },\n                \"NodeCount\": {\n                    \"type\": \"integer\",\n                    \"description\": \"Number of read-only nodes for MongoDB Cloud deploys to the region. Read-only nodes can never become the primary, but can enable local reads.\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"diskGB\": {\n            \"type\": \"object\",\n            \"description\": \"Automatic cluster storage settings that apply to this cluster.\",\n            \"properties\": {\n                \"Enabled\" : {\n                    \"type\": \"boolean\",\n                    \"description\": \"Flag that indicates whether this cluster enables disk auto-scaling. The maximum memory allowed for the selected cluster tier and the oplog size can limit storage auto-scaling.\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"advancedReplicationSpec\": {\n            \"type\": \"object\",\n            \"description\": \"List of settings that configure your cluster regions. For Global Clusters, each object in the array represents a zone where your clusters nodes deploy. For non-Global replica sets and sharded clusters, this array has one object representing where your clusters nodes deploy.\",\n            \"properties\": {\n                \"ID\": {\n                    \"type\": \"string\",\n                    \"description\": \"Unique 24-hexadecimal digit string that identifies the replication object for a zone in a Multi-Cloud Cluster. If you include existing zones in the request, you must specify this parameter. If you add a new zone to an existing Multi-Cloud Cluster, you may specify this parameter. The request deletes any existing zones in the Multi-Cloud Cluster that you exclude from the request.\"\n                },\n                \"NumShards\": {\n                    \"type\": \"integer\",\n                    \"description\": \"Positive integer that specifies the number of shards to deploy in each specified zone. If you set this value to 1 and \\\"clusterType\\\" : \\\"SHARDED\\\", MongoDB Cloud deploys a single-shard sharded cluster. Don't create a sharded cluster with a single shard for production environments. Single-shard sharded clusters don't provide the same benefits as multi-shard configurations.\"\n                },\n                \"AdvancedRegionConfigs\": {\n                    \"type\": \"array\",\n                    \"description\": \"Hardware specifications for nodes set for a given region. Each regionConfigs object describes the region's priority in elections and the number and type of MongoDB nodes that MongoDB Cloud deploys to the region. Each regionConfigs object must have either an analyticsSpecs object, electableSpecs object, or readOnlySpecs object. Tenant clusters only require electableSpecs. Dedicated clusters can specify any of these specifications, but must have at least one electableSpecs object within a replicationSpec. Every hardware specification must use the same instanceSize.\\n\\nExample:\\n\\nIf you set \\\"replicationSpecs[n].regionConfigs[m].analyticsSpecs.instanceSize\\\" : \\\"M30\\\", set \\\"replicationSpecs[n].regionConfigs[m].electableSpecs.instanceSize\\\" : \\\"M30\\\"if you have electable nodes and\\\"replicationSpecs[n].regionConfigs[m].readOnlySpecs.instanceSize\\\" : \\\"M30\\\" if you have read-only nodes.\\\",\",\n                    \"items\": {\n                        \"$ref\": \"#/definitions/advancedRegionConfig\"\n                    }\n                },\n                \"ZoneName\": {\n                    \"type\": \"string\",\n                    \"description\": \"Human-readable label that identifies the zone in a Global Cluster. Provide this value only if \\\"clusterType\\\" : \\\"GEOSHARDED\\\".\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"apiKeyDefinition\": {\n            \"type\": \"object\",\n            \"properties\": {\n                \"PublicKey\": {\n                    \"type\": \"string\"\n                },\n                \"PrivateKey\": {\n                    \"type\": \"string\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"connectionStrings\": {\n            \"type\": \"object\",\n            \"description\": \"Collection of Uniform Resource Locators that point to the MongoDB database.\",\n            \"properties\": {\n                \"Standard\": {\n                    \"type\": \"string\",\n                    \"description\": \"Public connection string that you can use to connect to this cluster. This connection string uses the mongodb:// protocol.\"\n                },\n                \"StandardSrv\": {\n                    \"type\": \"string\",\n                    \"description\": \"Public connection string that you can use to connect to this cluster. This connection string uses the mongodb+srv:// protocol.\"\n                },\n                \"Private\": {\n                    \"type\": \"string\",\n                    \"description\": \"Network peering connection strings for each interface Virtual Private Cloud (VPC) endpoint that you configured to connect to this cluster. This connection string uses the mongodb+srv:// protocol. The resource returns this parameter once someone creates a network peering connection to this cluster. This protocol tells the application to look up the host seed list in the Domain Name System (DNS). This list synchronizes with the nodes in a cluster. If the connection string uses this Uniform Resource Identifier (URI) format, you don't need to append the seed list or change the URI if the nodes change. Use this URI format if your driver supports it. If it doesn't, use connectionStrings.private. For Amazon Web Services (AWS) clusters, this resource returns this parameter only if you enable custom DNS.\"\n                },\n                \"PrivateSrv\": {\n                    \"type\": \"string\",\n                    \"description\": \"Network peering connection strings for each interface Virtual Private Cloud (VPC) endpoint that you configured to connect to this cluster. This connection string uses the mongodb+srv:// protocol. The resource returns this parameter when someone creates a network peering connection to this cluster. This protocol tells the application to look up the host seed list in the Domain Name System (DNS). This list synchronizes with the nodes in a cluster. If the connection string uses this Uniform Resource Identifier (URI) format, you don't need to append the seed list or change the Uniform Resource Identifier (URI) if the nodes change. Use this Uniform Resource Identifier (URI) format if your driver supports it. If it doesn't, use connectionStrings.private. For Amazon Web Services (AWS) clusters, this parameter returns only if you enable custom DNS.\"\n                },\n                \"PrivateEndpoint\": {\n                    \"type\": \"array\",\n                    \"description\": \"List of private endpoint connection strings that you can use to connect to this cluster through a private endpoint. This parameter returns only if you deployed a private endpoint to all regions to which you deployed this clusters' nodes.\",\n                    \"items\": {\n                        \"$ref\": \"#/definitions/privateEndpoint\"\n                    }\n                },\n                \"AwsPrivateLinkSrv\": {\n                    \"type\": \"string\",\n                    \"description\": \"Private endpoint-aware connection strings that use AWS-hosted clusters with Amazon Web Services (AWS) PrivateLink. Each key identifies an Amazon Web Services (AWS) interface endpoint. Each value identifies the related mongodb:// connection string that you use to connect to Atlas through the interface endpoint that the key names.\"\n                },\n                \"AwsPrivateLink\": {\n                    \"type\": \"string\",\n                    \"description\": \"Private endpoint-aware connection strings that use AWS-hosted clusters with Amazon Web Services (AWS) PrivateLink. Each key identifies an Amazon Web Services (AWS) interface endpoint. Each value identifies the related mongodb:// connection string that you use to connect to MongoDB Cloud through the interface endpoint that the key names.\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"privateEndpoint\": {\n            \"type\": \"object\",\n            \"description\": \"List of private endpoint connection strings that you can use to connect to this cluster through a private endpoint. This parameter returns only if you deployed a private endpoint to all regions to which you deployed this clusters' nodes.\",\n            \"properties\": {\n                \"ConnectionString\": {\n                    \"type\": \"string\",\n                    \"description\": \"Private endpoint-aware connection string that uses the mongodb:// protocol to connect to MongoDB Cloud through a private endpoint.\"\n                },\n                \"Endpoints\": {\n                    \"type\": \"array\",\n                    \"description\": \"List that contains the private endpoints through which you connect to MongoDB Cloud when you use connectionStrings.privateEndpoint[n].connectionString or connectionStrings.privateEndpoint[n].srvConnectionString.\",\n                    \"items\": {\n                        \"$ref\": \"#/definitions/endpoint\"\n                    }\n                },\n                \"SRVConnectionString\": {\n                    \"type\": \"string\",\n                    \"description\": \"Private endpoint-aware connection string that uses the mongodb+srv:// protocol to connect to MongoDB Cloud through a private endpoint. The mongodb+srv protocol tells the driver to look up the seed list of hosts in the Domain Name System (DNS). This list synchronizes with the nodes in a cluster. If the connection string uses this Uniform Resource Identifier (URI) format, you don't need to append the seed list or change the Uniform Resource Identifier (URI) if the nodes change. Use this Uniform Resource Identifier (URI) format if your application supports it. If it doesn't, use connectionStrings.privateEndpoint[n].connectionString.\"\n                },\n                \"Type\": {\n                    \"type\": \"string\",\n                    \"description\": \"Enum: \\\"MONGOD\\\" \\\"MONGOS\\\"\\nMongoDB process type to which your application connects. Use MONGOD for replica sets and MONGOS for sharded clusters.\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"endpoint\": {\n            \"type\": \"object\",\n            \"properties\": {\n                \"EndpointID\": {\n                    \"type\": \"string\",\n                    \"description\": \"Unique string that the cloud provider uses to identify the private endpoint.\"\n                },\n                \"ProviderName\": {\n                    \"type\": \"string\",\n                    \"description\": \"Cloud provider in which MongoDB Cloud deploys the private endpoint.\"\n                },\n                \"Region\": {\n                    \"type\": \"string\",\n                    \"description\": \"Region in which MongoDB Cloud deploys the private endpoint.\"\n                }\n            },\n            \"additionalProperties\": false\n        },\n        \"processArgs\": {\n            \"type\": \"object\",\n            \"description\": \"Advanced configuration details to add for one cluster in the specified project.\",\n            \"properties\": {\n                \"DefaultReadConcern\":{\n                    \"type\": \"string\",\n                    \"description\": \"Default level of acknowledgment requested from MongoDB for read operations set for this cluster.\"\n                },\n                \"DefaultWriteConcern\":{\n                    \"type\": \"string\",\n                    \"description\": \"Default level of acknowledgment requested from MongoDB for write operations set for this cluster.\"\n                },\n                \"FailIndexKeyTooLong\":{\n                    \"type\": \"boolean\",\n                    \"description\": \"Flag that indicates whether you can insert or update documents where all indexed entries don't exceed 1024 bytes. If you set this to false, mongod writes documents that exceed this limit but doesn't index them.\"\n                },\n                \"JavascriptEnabled\":{\n                    \"type\": \"boolean\",\n                    \"description\": \"Flag that indicates whether the cluster allows execution of operations that perform server-side executions of JavaScript.\"\n                },\n                \"MinimumEnabledTLSProtocol\":{\n                    \"type\": \"string\",\n                    \"description\": \"Minimum Transport Layer Security (TLS) version that the cluster accepts for incoming connections. Clusters using TLS 1.0 or 1.1 should consider setting TLS 1.2 as the minimum TLS protocol version.\"\n                },\n                \"NoTableScan\":{\n                    \"type\": \"boolean\",\n                    \"description\": \"Flag that indicates whether the cluster disables executing any query that requires a collection scan to return results.\"\n                },\n                \"OplogSizeMB\":{\n                    \"type\": \"integer\",\n                    \"description\": \"Storage limit of cluster's oplog expressed in megabytes. A value of null indicates that the cluster uses the default oplog size that MongoDB Cloud calculates.\"\n                },\n                \"SampleSizeBIConnector\":{\n                    \"type\": \"integer\",\n                    \"description\": \"Interval in seconds at which the mongosqld process re-samples data to create its relational schema.\"\n                },\n                \"SampleRefreshIntervalBIConnector\":{\n                    \"type\": \"integer\",\n                    \"description\": \"Number of documents per database to sample when gathering schema information.\"\n                }\n            },\n            \"additionalProperties\": false\n        }\n    },\n    \"properties\": {\n        \"AdvancedSettings\": {\n            \"$ref\": \"#/definitions/processArgs\"\n        },\n        \"ApiKeys\": {\n            \"$ref\": \"#/definitions/apiKeyDefinition\"\n        },\n        \"BackupEnabled\": {\n            \"description\": \"Flag that indicates whether the cluster can perform backups. If set to true, the cluster can perform backups. You must set this value to true for NVMe clusters. Backup uses Cloud Backups for dedicated clusters and Shared Cluster Backups for tenant clusters. If set to false, the cluster doesn't use backups.\",\n            \"type\": \"boolean\"\n        },\n        \"BiConnector\": {\n            \"type\": \"object\",\n            \"properties\": {\n                \"ReadPreference\": {\n                    \"type\": \"string\",\n                    \"description\": \"Data source node designated for the MongoDB Connector for Business Intelligence on MongoDB Cloud. The MongoDB Connector for Business Intelligence on MongoDB Cloud reads data from the primary, secondary, or analytics node based on your read preferences. Defaults to ANALYTICS node, or SECONDARY if there are no ANALYTICS nodes.\"\n                },\n                \"Enabled\": {\n                    \"type\": \"boolean\",\n                    \"description\": \"Flag that indicates whether MongoDB Connector for Business Intelligence is enabled on the specified cluster.\"\n                }\n            },\n            \"description\": \"Settings needed to configure the MongoDB Connector for Business Intelligence for this cluster.\",\n            \"additionalProperties\": false\n        },\n        \"ClusterType\": {\n            \"description\": \"Configuration of nodes that comprise the cluster.\",\n            \"type\": \"string\"\n        },\n        \"CreatedDate\": {\n            \"description\": \"Date and time when MongoDB Cloud created this cluster. This parameter expresses its value in ISO 8601 format in UTC.\",\n            \"type\": \"string\"\n        },\n        \"ConnectionStrings\": {\n            \"description\": \"Set of connection strings that your applications use to connect to this cluster. Use the parameters in this object to connect your applications to this cluster. See the MongoDB [Connection String URI Format](https://docs.mongodb.com/manual/reference/connection-string/) reference for further details.\",\n            \"$ref\": \"#/definitions/connectionStrings\"\n        },\n        \"DiskSizeGB\": {\n            \"description\": \"Storage capacity that the host's root volume possesses expressed in gigabytes. Increase this number to add capacity. MongoDB Cloud requires this parameter if you set replicationSpecs. If you specify a disk size below the minimum (10 GB), this parameter defaults to the minimum disk size value. Storage charge calculations depend on whether you choose the default value or a custom value. The maximum value for disk storage cannot exceed 50 times the maximum RAM for the selected cluster. If you require more storage space, consider upgrading your cluster to a higher tier.\",\n            \"type\": \"number\"\n        },\n        \"EncryptionAtRestProvider\": {\n            \"description\": \"Cloud service provider that manages your customer keys to provide an additional layer of encryption at rest for the cluster. To enable customer key management for encryption at rest, the cluster replicationSpecs[n].regionConfigs[m].{type}Specs.instanceSize setting must be M10 or higher and \\\"backupEnabled\\\" : false or omitted entirely.\",\n            \"type\": \"string\",\n            \"enum\": [\n                \"AWS\",\n                \"GCP\",\n                \"AZURE\",\n                \"NONE\"\n            ]\n        },\n        \"ProjectId\": {\n            \"description\": \"Unique identifier of the project the cluster belongs to.\",\n            \"type\": \"string\"\n        },\n        \"Id\": {\n            \"description\": \"Unique identifier of the cluster.\",\n            \"type\": \"string\"\n        },\n        \"Labels\": {\n            \"description\": \"Collection of key-value pairs between 1 to 255 characters in length that tag and categorize the cluster. The MongoDB Cloud console doesn't display your labels.\",\n            \"type\": \"array\",\n            \"items\": {\n                \"type\": \"object\",\n                \"properties\": {\n                    \"Key\": {\n                        \"type\": \"string\",\n                        \"minLength\": 1,\n                        \"maxLength\": 255\n                    },\n                    \"Value\": {\n                        \"type\": \"string\",\n                        \"minLength\": 1,\n                        \"maxLength\": 255\n                    }\n                },\n                \"additionalProperties\": false\n            }\n        },\n        \"MongoDBMajorVersion\": {\n            \"description\": \"Major MongoDB version of the cluster. MongoDB Cloud deploys the cluster with the latest stable release of the specified version.\",\n            \"type\": \"string\"\n        },\n        \"MongoDBVersion\": {\n            \"description\": \"Version of MongoDB that the cluster runs.\",\n            \"type\": \"string\"\n        },\n        \"Name\": {\n            \"description\": \"Human-readable label that identifies the advanced cluster.\",\n            \"type\": \"string\"\n        },\n        \"Paused\": {\n            \"description\": \"Flag that indicates whether the cluster is paused or not.\",\n            \"type\": \"boolean\"\n        },\n        \"PitEnabled\": {\n            \"description\": \"Flag that indicates whether the cluster uses continuous cloud backups.\",\n            \"type\": \"boolean\"\n        },\n        \"ReplicationSpecs\": {\n            \"description\": \"List of settings that configure your cluster regions. For Global Clusters, each object in the array represents a zone where your clusters nodes deploy. For non-Global replica sets and sharded clusters, this array has one object representing where your clusters nodes deploy.\",\n            \"type\": \"array\",\n            \"items\": {\n                \"$ref\": \"#/definitions/advancedReplicationSpec\"\n            }\n        },\n        \"RootCertType\": {\n            \"description\": \"Root Certificate Authority that MongoDB Cloud cluster uses. MongoDB Cloud supports Internet Security Research Group.\",\n            \"type\": \"string\"\n        },\n        \"StateName\": {\n            \"description\": \"Current state of the cluster.\",\n            \"type\": \"string\"\n        },\n        \"VersionReleaseSystem\": {\n            \"description\": \"Method by which the cluster maintains the MongoDB versions. If value is CONTINUOUS, you must not specify mongoDBMajorVersion\",\n            \"type\": \"string\"\n        },\n        \"TerminationProtectionEnabled\": {\n            \"description\": \"Flag that indicates whether termination protection is enabled on the cluster. If set to true, MongoDB Cloud won't delete the cluster. If set to false, MongoDB Cloud will delete the cluster.\",\n            \"type\": \"boolean\"\n        }\n    },\n    \"additionalProperties\": false,\n    \"required\": [\n        \"Name\",\n        \"ProjectId\",\n        \"ApiKeys\"\n    ],\n    \"readOnlyProperties\": [\n        \"/properties/ConnectionStrings/Standard\",\n        \"/properties/ConnectionStrings/StandardSrv\",\n        \"/properties/ConnectionStrings/Private\",\n        \"/properties/ConnectionStrings/PrivateSrv\",\n        \"/properties/StateName\",\n        \"/properties/MongoDBVersion\",\n        \"/properties/CreatedDate\",\n        \"/properties/Id\"\n    ],\n    \"primaryIdentifier\": [\n        \"/properties/Id\"\n    ],\n    \"handlers\": {\n        \"create\": {\n            \"permissions\": [\n                \"secretsmanager:DescribeSecret\",\n                \"secretsmanager:GetSecretValue\",\n                \"secretsmanager:PutSecretValue\",\n                \"secretsmanager:UpdateSecretVersionStage\",\n                \"secretsmanager:CreateSecret\",\n                \"secretsmanager:CreateSecretInput\"\n            ]\n        },\n        \"read\": {\n            \"permissions\": [\n                \"secretsmanager:DescribeSecret\",\n                \"secretsmanager:GetSecretValue\",\n                \"secretsmanager:PutSecretValue\",\n                \"secretsmanager:UpdateSecretVersionStage\",\n                \"secretsmanager:CreateSecret\",\n                \"secretsmanager:CreateSecretInput\"\n            ]\n        },\n        \"update\": {\n            \"permissions\": [\n                \"secretsmanager:DescribeSecret\",\n                \"secretsmanager:GetSecretValue\",\n                \"secretsmanager:PutSecretValue\",\n                \"secretsmanager:UpdateSecretVersionStage\",\n                \"secretsmanager:CreateSecret\",\n                \"secretsmanager:CreateSecretInput\"\n            ]\n        },\n        \"delete\": {\n            \"permissions\": [\n                \"secretsmanager:DescribeSecret\",\n                \"secretsmanager:GetSecretValue\",\n                \"secretsmanager:PutSecretValue\",\n                \"secretsmanager:UpdateSecretVersionStage\",\n                \"secretsmanager:CreateSecret\",\n                \"secretsmanager:CreateSecretInput\"\n            ]\n        }\n    }\n}\n",
  "ProvisioningType": "FULLY_MUTABLE",
  "DeprecatedStatus": "LIVE",
  "RequiredActivatedTypes": [],
  "Visibility": "PUBLIC",
  "TimeCreated": "2023-01-03T07:45:42.371Z",
  "PublisherId": "bb989456c78c398a858fef18f2ca1bfc1fbba082",
  "LatestPublicVersion": "1.5.0",
  "IsActivated": false
}